app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(sign_in_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ajay.babar@ymail.com"], ["LIMIT", 1]]