app/controllers/todo_lists_controller.rb

SELECT "todo_list_items".* FROM "todo_list_items" WHERE "todo_list_items"."todo_list_id" IN ($1, $2)  [["todo_list_id", 3], ["todo_list_id", 1]]
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = $1  [["user_id", 2]]
---
  def index
    @page = params[:page] ? params[:page].to_i : PER_PAGE
    @size = params[:size] ? params[:size].to_i : PER_PAGE_SIZE
    @todo_lists = current_user.todo_lists.includes(:todo_list_items).page(@page).per(@size)

INSERT INTO "todo_lists" ("user_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "test"], ["description", "test description"], ["created_at", "2019-05-13 18:00:58.146032"], ["updated_at", "2019-05-13 18:00:58.146032"]]
---
  def create
    @todo_list = current_user.todo_lists.new(todo_list_params)

    if @todo_list.save

UPDATE "todo_lists" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "todo_lists"."id" = $4  [["title", "This is first ToDoList - One"], ["description", "Test - 1"], ["updated_at", "2019-04-28 09:10:22.969457"], ["id", 1]]
---
  def update
    if @todo_list.update(todo_list_params)

DELETE FROM "todo_lists" WHERE "todo_lists"."id" = $1  [["id", 2]]
---
  def destroy
    @todo_list.destroy

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = $1 AND "todo_lists"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_todo_list
      @todo_list = current_user.todo_lists.find(params[:id])