app/controllers/todo_list_items_controller.rb

INSERT INTO "todo_list_items" ("todo_list_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["todo_list_id", 1], ["title", "test"], ["created_at", "2019-05-13 18:02:26.682386"], ["updated_at", "2019-05-13 18:02:26.682386"]]
---
  def create
    @item = @todo_list.todo_list_items.new(todo_list_item_params)

    if @item.save

UPDATE "todo_list_items" SET "title" = $1, "updated_at" = $2 WHERE "todo_list_items"."id" = $3  [["title", "test1"], ["updated_at", "2019-05-13 18:18:57.863201"], ["id", 1]]
---
  def update
    if @item.update(todo_list_item_params)

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "todo_list_items".* FROM "todo_list_items" WHERE "todo_list_items"."todo_list_id" = $1 AND "todo_list_items"."id" = $2 LIMIT $3  [["todo_list_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_todo_list_item
      @item = @todo_list.todo_list_items.find_by_id(params[:id])

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_todo_list
      @todo_list = TodoList.find_by_id(params[:todo_list_id])